update sequence diagram
